---
kind: method
id: M:Autodesk.Revit.DB.IATFTranslationServer.Translate(Autodesk.Revit.DB.ATFTranslationServiceData)
source: html/5903625b-eee7-8373-6d69-309868710529.htm
---
# Autodesk.Revit.DB.IATFTranslationServer.Translate Method

Translate a model according to translationData settings

## Syntax (C#)
```csharp
bool Translate(
	ATFTranslationServiceData serviceData
)
```

## Parameters
- **serviceData** (`ATFTranslationServiceData`)

## Returns
Returns true if the translation finished successfully, false otherwise.